import { EmailTemplate } from "../types";

export const EmailVerificationTemplate: EmailTemplate["emailVerification"] = {
  subject: "Підтвердіть вашу електронну адресу",
  body: {
    previewText: "Підтвердіть вашу електронну адресу",
    content: [
      {
        type: "title",
        text: "Підтвердіть вашу електронну адресу",
      },
      {
        type: "text",
        text: `Привіт **{{name}}**,

Будь ласка, підтвердіть вашу електронну адресу, натиснувши на кнопку нижче. Це допоможе нам підтвердити, що ви є власником цієї електронної адреси і зберігає ваш обліковий запис безпечним.`,
      },
      {
        type: "button",
        button: {
          text: "Підтвердити мою електронну адресу",
          url: "{{url}}",
        },
      },
      {
        type: "text",
        text: `>**Кнопка не працює?**  

> <span style="font-size: 12px;">Скопіюйте та вставте посилання нижче в ваш браузер:</span>  
 
> <span style="font-size: 12px;">{{url}}</span>

---

### Важливі зауваження

- <span style="font-size: 12px;">Цей посилання на підтвердження **закінчується через 24 години**</span>
- <span style="font-size: 12px;">Якщо ви **не створювали** обліковий запис, ігноруйте цей email - не потрібно ніякої дії</span>
- <span style="font-size: 12px;">**Ніколи не діліться** цим посиланням з будь-ким для безпеки вашого облікового запису</span>

---`,
      },
    ],
  },
};
